# THIS FILE IS AUTOMATICALLY GENERATED
# Project: H:\Githubrepo\Intern\PSoC\Final_project01_54Byte.cydsn\Final_project01_54Byte.cyprj
# Date: Fri, 21 May 2021 08:23:50 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyClk_LF} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyPLL0} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyClk_HF0} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {ADC_1_intSarClock} -source [get_pins {ClockBlock/periclk}] -edges {1 75 151} -nominal_period 1000 [list [get_pins {ClockBlock/ff_div_49}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 55 109} -nominal_period 720 [list [get_pins {ClockBlock/ff_div_5}]]
create_generated_clock -name {WS_SPI_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 9 17} [list [get_pins {ClockBlock/ff_div_6}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/periclk}] -edges {1 7501 15001} -nominal_period 100000 [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {CyPeriClk_App} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for H:\Githubrepo\Intern\PSoC\Final_project01_54Byte.cydsn\TopDesign\TopDesign.cysch
# Project: H:\Githubrepo\Intern\PSoC\Final_project01_54Byte.cydsn\Final_project01_54Byte.cyprj
# Date: Fri, 21 May 2021 08:23:23 GMT
